# Création d'un pipeline ETL basique
Nous allons d'abord créer un fichier csv contenant les données d'études.

In [1]:
import pandas as pd
import names
import numpy as np

In [2]:
person = {"id": [i+1 for i in range(50)],
          "names": [names.get_full_name() for i in range(50)],
          "ages": list(np.random.randint(low=18, high=35, size=50))
         }

Définir un index pour notre dataframe

In [11]:
data.set_index('id', inplace=True)

In [12]:
data = pd.DataFrame(person)
data.head()

   id            names  ages
0   1   Stephen Gehrke    19
1   2      Carol Brown    33
2   3  Alonzo Kirkland    27
3   4     Dorcas Tracy    20
4   5    Geneva Wilson    24

In [13]:
data.to_csv("data_etl.csv")

Assure-toi d’avoir les bibliothèques nécessaires en Python : pandas pour manipuler les données et sqlite3 pour créer une base de données SQLite.

## Extraction : Lire les données à partir du fichier CSV.

In [14]:
dt = pd.read_csv("data_etl.csv")
dt.head()

   Unnamed: 0  id            names  ages
0           0   1   Stephen Gehrke    19
1           1   2      Carol Brown    33
2           2   3  Alonzo Kirkland    27
3           3   4     Dorcas Tracy    20
4           4   5    Geneva Wilson    24

## Transformation : Ajouter une nouvelle colonne age_category en fonction de l'âge.

In [17]:
def categorize_age(age):
    if age < 25:
        return 'Young'
    elif age < 35:
        return 'Adult'
    else:
        return 'Senior'

data['age_category'] = data['ages'].apply(categorize_age)
data.head()

   id            names  ages age_category
0   1   Stephen Gehrke    19        Young
1   2      Carol Brown    33        Adult
2   3  Alonzo Kirkland    27        Adult
3   4     Dorcas Tracy    20        Young
4   5    Geneva Wilson    24        Young

## Chargement : Charger les données transformées dans une base de données SQLite.

In [18]:
import sqlite3

In [19]:
# Connexion à la base de données
conn = sqlite3.connect('example.db')
data.to_sql('users', conn, if_exists='replace', index=False)

print("\nDonnées chargées dans la base SQLite")

Données chargées dans la base SQLite

## Validation : Vérifie que les données sont bien chargées.

In [20]:
# Vérification
result = pd.read_sql("SELECT * FROM users", conn)
print("\nDonnées dans la base de données :")
print(result)
conn.close()

Données dans la base de données :
    id                 names  ages age_category
0    1        Stephen Gehrke    19        Young
1    2           Carol Brown    33        Adult
2    3       Alonzo Kirkland    27        Adult
3    4          Dorcas Tracy    20        Young
4    5         Geneva Wilson    24        Young
5    6       Aubrey Williams    22        Young
6    7        William Schick    28        Adult
7    8           John Sigler    23        Young
8    9    Florencio Jellison    30        Adult
9   10     Matilda Guillaume    33        Adult
10  11           Susan Jones    26        Adult
11  12      Georgia Anderson    30        Adult
12  13       Lourdes Brazile    18        Young
13  14        Lillie Manahan    24        Young
14  15          Annie Colvin    25        Adult
15  16          Betty Lester    26        Adult
16  17          Carolyn Knox    22        Young
17  18          Patrick Gate    21        Young
18  19          Thomas Kelly    18        Young
19  20     Elizabeth Futrell    31        Adult
20  21           Steven Bush    32        Adult
21  22      Joshua Bollinger    29        Adult
22  23        Patrice Hester    29        Adult
23  24        William Hamler    24        Young
24  25        Karen Langford    24        Young
25  26        Joseph Collins    31        Adult
26  27        Roger Campbell    29        Adult
27  28         Richard Smith    34        Adult
28  29           Irene Lingo    23        Young
29  30            Shayna Sam    26        Adult
30  31         Antony Watson    21        Young
31  32          Tony Pacheco    28        Adult
32  33            Lupe Davis    23        Young
33  34      Mildred Marshall    25        Adult
34  35           Kevin Hardy    28        Adult
35  36      Michael Blackmon    33        Adult
36  37        Maggie Sanchez    27        Adult
37  38           Glen Delapp    22        Young
38  39          Brian Blanco    23        Young
39  40    Katherine Ocegueda    27        Adult
40  41         Rudolph Gwinn    34        Adult
41  42           Keith Nicol    20        Young
42  43        Angela Ramirez    23        Young
43  44        Megan Crockett    20        Young
44  45     Michael Lorenzana    31        Adult
45  46        Laura Devereux    31        Adult
46  47            Jody Hicks    22        Young
47  48  Christina Sutherland    18        Young
48  49        Shane Striegel    26        Adult
49  50      Reginald Cordova    19        Young